### Working with Columns names

- how to check columns
- how to rename columns
- how to put underscore in all columns
- how to upper/lower case columns
- how to replace character/empty space in column names
- how to select all columns except one
- how to select columns of a particular order or phrase
- how to select a group of a column
- how to add prefix or suffix

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Randomly Generated Dataset.csv')

In [3]:
df.head()

            ID First and Second Name   Sales       Location
0  349123 2108    Johnson, Kenyon M.  £79.64  Chernogolovka
1  237000 4349    Berger, Zelenia X.  £47.30         Wayaux
2  643272 7003     Moreno, Harlan X.  £93.80      Vysokovsk
3  438439 8923      Horne, Stuart W.  £94.69  Northallerton
4  494639 1622   Benjamin, Denton A.  £87.26      Newmarket

In [4]:
# Get column names as an array
df.columns.values

array(['ID', 'First and Second Name', 'Sales', 'Location'], dtype=object)

In [5]:
# get column names as a list
df.columns.tolist()

['ID', 'First and Second Name', 'Sales', 'Location']

In [6]:
# to view column names
df.columns.view()

Index(['ID', 'First and Second Name', 'Sales', 'Location'], dtype='object')

In [24]:
# convert column names to series
df.columns.to_series()

IDnumber                              IDnumber
First and Second Name    First and Second Name
Sales                                    Sales
City                                      City
dtype: object

In [8]:
# convert column names to dataframe
df.columns.to_frame()

                                           0
ID                                        ID
First and Second Name  First and Second Name
Sales                                  Sales
Location                            Location

In [9]:
# check to see if column names are duplicated
df.columns.duplicated('Johnson')

array([False, False, False, False])

In [10]:
# attributes and methods of strings list
dir(df.columns.str)

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__frozen',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_doc_args',
 '_freeze',
 '_get_series_list',
 '_inferred_dtype',
 '_is_categorical',
 '_is_string',
 '_make_accessor',
 '_orig',
 '_parent',
 '_validate',
 '_wrap_result',
 'capitalize',
 'casefold',
 'cat',
 'center',
 'contains',
 'count',
 'decode',
 'encode',
 'endswith',
 'extract',
 'extractall',
 'find',
 'findall',
 'fullmatch',
 'get',
 'get_dummies',
 'index',
 'isalnum',
 'isalpha',
 'isdecimal',
 'isdigit',
 'islower',
 'isnumeric',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'len',
 'ljust',
 'lower',
 'lstrip',
 'match',
 'normalize',
 'pad',
 'partition',
 'repeat',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'slice',
 'slice_replace',
 'split',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'wrap',
 'zfill']

In [11]:
# making column name lower case/ upper case
df.columns.str.lower()

Index(['id', 'first and second name', 'sales', 'location'], dtype='object')

In [12]:
# Making column name title case (first letter of each word capitalised)
df.columns.str.title()

Index(['Id', 'First And Second Name', 'Sales', 'Location'], dtype='object')

In [13]:
# making first letter of column capitalized
df.columns.str.capitalize()

Index(['Id', 'First and second name', 'Sales', 'Location'], dtype='object')

In [14]:
df['First and Second Name']

0      Johnson, Kenyon M.
1      Berger, Zelenia X.
2       Moreno, Harlan X.
3        Horne, Stuart W.
4     Benjamin, Denton A.
             ...
95       Paul, Charity Z.
96          Price, Tad T.
97      Edwards, Rahim W.
98          Fox, Nerea L.
99     Simmons, Maggie F.
Name: First and Second Name, Length: 100, dtype: object

In [15]:
# Replacing empty spaces with underscores
df.columns.str.replace(' ', '_')

Index(['ID', 'First_and_Second_Name', 'Sales', 'Location'], dtype='object')

In [16]:
# renaming column names
df.rename(columns={'Location':'City'})

             ID First and Second Name   Sales               City
0   349123 2108    Johnson, Kenyon M.  £79.64      Chernogolovka
1   237000 4349    Berger, Zelenia X.  £47.30             Wayaux
2   643272 7003     Moreno, Harlan X.  £93.80          Vysokovsk
3   438439 8923      Horne, Stuart W.  £94.69      Northallerton
4   494639 1622   Benjamin, Denton A.  £87.26          Newmarket
..          ...                   ...     ...                ...
95  203198 0606      Paul, Charity Z.  £96.41          Bonavista
96  657743 4332         Price, Tad T.  £20.07              Laval
97  245522 5678     Edwards, Rahim W.  £64.70  Le Grand-Quevilly
98  102899 6815         Fox, Nerea L.  £18.59             Juneau
99  378846 0990    Simmons, Maggie F.  £59.20         Nacimiento

[100 rows x 4 columns]

In [17]:
# to apply this change to original df
df.rename(columns={'Location':'City'},inplace=True)

In [18]:
df.columns

Index(['ID', 'First and Second Name', 'Sales', 'City'], dtype='object')

In [19]:
# length of columns
len(df.columns)

4

In [20]:
# renaming column names using select values
df.columns.values[0] = 'IDnumber'

In [21]:
# Selecting all columns except 1
df.columns[df.columns != 'First and Second Name']

Index(['IDnumber', 'Sales', 'City'], dtype='object')

In [22]:
# Selecting all columns except 1 (2nd method)
df.loc[:,df.columns != 'Sales'].columns

Index(['IDnumber', 'First and Second Name', 'City'], dtype='object')

In [23]:
# Select a group of column names
df.columns.values[[0,3]]

array(['IDnumber', 'City'], dtype=object)